<?php


/**
 * 通用代码区域
 */
$common = [
    '-1' => '未定义的异常',
    '0' => '操作成功',
    '1' => '操作失败',
    '401' => '未登录或者登录超时',
    '403' => '没权限访问',
    '404' => '未找到资源',
    '405' => '非法请求',
    '500' => '程序异常',
    '10001' => '参数不符合规则',
    '10002' => '账号被禁用',
    '10003' => '请求头中的 sub 为空!',
    '10004' => '用户 :id 不存在!',
    '10005' => '请求失败！',
    '10006' => '客户已被锁定',
    '10007' => '无权限访问',
    '10008' => '无效平台标识',
    '10009' => ':type :name 不可删除，已被分配',
    '10010' => '数据为空',
    '10011' => '更新失败, 请确认id :id 是否存在!',
    '10012' => '查找失败, 请确认id :id 是否存在!',
    '10013' => 'JWT token 刷新异常!',
    '10014' => '返回的数据格式不合法: :data!'
];

return $common;