<?php


/**
 * 通用代码区域
 */
$common = [
    '-1' => '未定义的异常',
    '0' => '操作成功',
    '1' => '操作失败',
    '401' => '未登录或者登录超时',
    '403' => '没权限访问',
    '404' => '未找到资源',
    '405' => '非法请求',
    '500' => '程序异常',
    '10001' => '参数不符合规则',
    '10002' => '登录成功',
    '10003' => '用户名或密码错误',
    '10004' => '退出登录成功',
    '10008' => '用户已存在',
    '10009' => '用户不存在',
    '10012' => '邮箱已存在',
    '10013' => '该账户名称已经被占用',
    '10015' => '账号被禁用',
    '11001' => '两次输入的密码不一样',
    '11002' => '输入的原始密码不正确',
    '11003' => '新密码和原始密码一样',
    '11004' => '请求头中的 sub 为空!',
    '11005' => '用户 :id 不存在!',
    '11006' => ':type :name 已经被占用!',
    '11007' => '邮箱 :email 已经被占用!',
    '11008' => '请求失败！',
    '11009' => '客户已被锁定',
    '11010' => '无权限访问',
    '11011' => '无效平台标识',
    '11012' => '角色: :name 不可删除,存在可用子角色',
    '11014' => '客户 :id 被使用，不可禁用',
    '11015' => '权限描述 :name 已经被占用!',
    '11016' => ':type :name 不可删除，已被分配',
    '11017' => '扩展字段变量 :name 已经被占用',
    '11018' => '客户主账户不存在!',


];

return $common;